DROP SCHEMA IF EXISTS resources CASCADE;
CREATE SCHEMA resources;

SET search_path TO resources;


CREATE TABLE points (
    id SERIAL
        PRIMARY KEY,
    name varchar(256)
        NOT NULL,
	region varchar(256)
        NOT NULL,
    company varchar(256)
        NULL
);

CREATE TABLE resources (
    id SERIAL  
        PRIMARY KEY,
    name varchar(256)  
        NOT NULL,
    price numeric(10, 2)
        NOT NULL 
        CONSTRAINT positive_resource_price CHECK (price > 0),
    type varchar(256)    
        NOT NULL,
    unit varchar(256)  
        NOT NULL,
    image_url varchar(256)
);

CREATE TABLE deposits (
    id SERIAL  
        PRIMARY KEY,
    resource_id integer  
        REFERENCES resources ON DELETE RESTRICT  
        NOT NULL,
    point_id integer  
        REFERENCES points ON DELETE CASCADE  
        NOT NULL, -- при удалении пункта удаляются и месторождения
    percents_left numeric(4, 2)  
        DEFAULT 100 NOT NULL
        CONSTRAINT check_percents_left CHECK (percents_left >= 0 and percents_left <= 100), 
	initial_amount integer  
        NOT NULL
        CONSTRAINT positive_initial_amount CHECK (initial_amount > 0) -- in units!
);


CREATE TABLE workers (
    id SERIAL PRIMARY KEY,
    name varchar(256)
        NOT NULL,
	date_of_birth date
        CONSTRAINT ok_dob CHECK (date_of_birth > date '1920-01-01' and date_of_birth < current_timestamp),
    deposit_id integer
        NULL 
        DEFAULT NULL -- по умолчанию человек безработный
        REFERENCES deposits ON DELETE SET DEFAULT, -- когда месторождение закрывается, человек становится безработным
    salary numeric(10, 2)
        DEFAULT 1000 NOT NULL
        CONSTRAINT positive_salary CHECK (salary > 0)
);





CREATE TABLE extracted_stats (
    deposit_id integer  
        REFERENCES deposits ON DELETE CASCADE  -- при удалении месторождения стирается и статистика
        NOT NULL,
    year integer  
        DEFAULT date_part('year', current_timestamp)
        CONSTRAINT stats_year_ok CHECK (year > 1900 and year <= date_part('year', current_timestamp)),
    obtained_units numeric(10, 2)  
        NOT NULL,
    PRIMARY KEY (deposit_id, year)
);


CREATE TABLE equipment_models (
    id SERIAL  
        PRIMARY KEY,
    name varchar(256)  
        NOT NULL,
    weight numeric(8, 2) 
        NULL
        CONSTRAINT positive_weight_of_eqiupment CHECK (weight > 0),
    cost numeric(10, 2)  
        NULL
        CONSTRAINT positive_cost_of_equipment CHECK (cost > 0),
    category varchar(256)  
        NOT NULL
);

CREATE TABLE equipment_units (
    id SERIAL  
        PRIMARY KEY,
    equipment_model_id integer  
        REFERENCES equipment_models ON DELETE RESTRICT  
        NOT NULL,
    decommissioning_year integer  
        NOT NULL
        CONSTRAINT dec_year_ok CHECK (decommissioning_year > 1900 and decommissioning_year > date_part('year', current_timestamp))
);

CREATE TABLE equipment_availability (
    deposit_id integer  
        REFERENCES deposits ON DELETE CASCADE  
        NOT NULL, -- при удалении месторождения стираем информацию об оборудовании
    equipment_unit_id integer  
        REFERENCES equipment_units ON DELETE CASCADE  
        NOT NULL, -- при удалении единицы оборудования стираем информацию о её наличии
    PRIMARY KEY (deposit_id, equipment_unit_id)
);


CREATE TABLE mining_equipment_stats (
    model_id integer  
        PRIMARY KEY  
        REFERENCES equipment_models ON DELETE CASCADE,
    mining_speed numeric(8, 2)  
        NULL
        CONSTRAINT positive_mining_speed CHECK (mining_speed > 0)
);

CREATE TABLE transport_stats (
    model_id integer  
        PRIMARY KEY  
        REFERENCES equipment_models ON DELETE CASCADE,
    speed numeric(5, 2)  
        NULL
        CONSTRAINT positive_transport_speed CHECK (speed > 0),
    gasoline_consumption varchar(256)  
        DEFAULT 'Normal' 
        NULL
);


INSERT INTO points (name, region, company)
    VALUES 
    ('Новый Уренгой', 'Ямало-Ненецкий округ', 'Газпром'),
    ('Бованенковский', 'Ямало-Ненецкий округ', 'Газпром'),
    ('Харасавэйский', 'Западная Сибирь', 'Роснефть'),
    ('Оренбургский', 'Оренбуржье', 'Газпром'),
    ('Заполярный', 'Западная Сибирь', 'Лукойл'),
    ('Штокмановский', 'Баренцево море', 'Лукойл'),
    ('Ямбургский', 'Западная Сибирь', 'Новатэк'),
    ('Штокмановский', 'Ямало-Ненецкий округ', 'Татнефть'),
    ('Бованенковский', 'Ямало-Ненецкий округ', 'Роснефть'),
    ('Харасавэйский', 'Западная Сибирь ', 'Газпром');

INSERT INTO resources (name, price, type, unit, image_url)
    VALUES
    ('нефть', 77, 'горючие', 'баррель', 'https://upload.wikimedia.org/wikipedia/commons/a/ae/Petroleum_cm05.jpg'),
    ('природный газ', 900000, 'горючие', '1000 кубометров', NULL),
    ('горючие сланцы', 500, 'горючие', 'тонна', 'https://xn--80aegj1b5e.xn--p1ai/factory-files/styles/900n/public/image/pub/69.jpg?itok=E385xLmN'),
    ('торф', 30, 'горючие', 'кубический метр', 'https://upload.wikimedia.org/wikipedia/commons/thumb/8/89/Peat.JPG/1280px-Peat.JPG'),
    ('уголь', 110, 'горючие', 'тонна', 'https://upload.wikimedia.org/wikipedia/commons/2/20/Coal_bituminous.jpg'),
    ('железная руда', 70, 'руда', 'тонна', 'https://upload.wikimedia.org/wikipedia/commons/2/2e/HematitaEZ.jpg'),
    ('калийная соль', 1, 'минеральный ресурс', 'килограмм', 'https://mk0fertilizerdauhxos.kinstacdn.com/wp-content/uploads/2020/06/C0074174-Sylvite_mineral_smanjeno-1044x686.jpeg'),
    ('фосфорит', 50, 'минеральный ресурс', 'килограмм', 'https://upload.wikimedia.org/wikipedia/commons/thumb/c/c3/Phosphorit_%28Staffelit%29_-_Staffel_Lahngebiet.jpg/1024px-Phosphorit_%28Staffelit%29_-_Staffel_Lahngebiet.jpg'),
    ('алмаз', 10000, 'минеральный ресурс', 'карат', 'https://static.wikia.nocookie.net/minecraft_ru_gamepedia/images/5/57/%D0%90%D0%BB%D0%BC%D0%B0%D0%B7.png/revision/latest/scale-to-width-down/160?cb=20190424162100'),
    ('родонит', 136, 'камнесамоцветные', 'карат', 'https://upload.wikimedia.org/wikipedia/commons/6/6b/Rodonita2EZ.jpg');

INSERT INTO deposits (resource_id, point_id, percents_left, initial_amount)
VALUES
    (9, 1, 93.22, 168012),
    (2, 4, 83.12, 987365),
    (1, 1, 62.44, 731303),
    (4, 5, 6.01, 15003),
    (10, 3, 13.06, 640765),
    (5, 1, 38.75, 21758),
    (5, 3, 62.42, 370100),
    (2, 4, 72.09, 610735),
    (1, 7, 37.73, 23168),
    (6, 4, 4.00, 302852);

INSERT INTO workers (name, date_of_birth, deposit_id, salary)
    VALUES
    ('Арсеиньев Вячеслав Германович', '17.01.1985', 6, 134255),
    ('Труфанов Семен Егорович', '20.06.1971', 9, 148645),
    ('Сагадиев Антон Кириллович', '07.01.1970', 2, 127114),
    ('Желдин Даниил Федотович', '22.03.1969', 1, 42044),
    ('Нугаев Юрий Адамович', '23.12.1973', 5, 142410),
    ('Юферев Игнат Маркович', '16.11.1972', 4, 104581),
    ('Долженко Федор Кириллович', '24.07.1995', 5, 26816),
    ('Вазов Иван Даниилович', '20.11.1982', 6, 130039),
    ('Касимов Петр Яковлевич', '06.05.1983', 4, 131649),
    ('Шерстов Алексей Панкратович', '17.02.1961', 4, 119446),
    ('Рожков Валерий Григорьевич', '10.10.1964', 6, 122774),
    ('Мишутин Роман Игнатьевич', '14.11.1981', 8, 20646),
    ('Рудов Георгий Константинович', '28.07.1985', 2, 115752),
    ('Назаров Никита Лукьевич', '02.04.1994', 4, 87856),
    ('Дернов Петр Денисович', '08.06.1975', 1, 27129),
    ('Колдаев Егор Степанович', '12.09.1968', 5, 46685),
    ('Шулепин Илья Львович', '09.09.1994', 8, 101393),
    ('Ижутин Степан Григорьевич', '18.09.1966', 9, 72868),
    ('Ерохин Макар Никитьевич', '03.01.1990', 4, 110384),
    ('Блок Степан Давидович', '10.12.1992', 2, 19365),
    ('Витвинский Арсений Иванович', '10.12.1969', 10, 57247),
    ('Труш Севастьян Фадеевич', '24.01.1976', 2, 64047),
    ('Исмайлов Николай Ильич', '23.08.1967', 6, 68607),
    ('Мясников Антон Савванович', '08.02.1963', 9, 144160),
    ('Козловский Савва Николаевич', '04.03.1970', 3, 85483),
    ('Юшков Тимофей Семенович', '08.12.1982', 10, 66098),
    ('Сапогов Юлиан Акимович', '21.10.1990', 3, 27417),
    ('Пудин Валерий Нифонтович', '14.07.1984', 5, 89992),
    ('Коптильников Геннадий Ипполитович', '06.08.1962', 6, 20284),
    ('Уланов Прохор Иванович', '26.10.1994', 4, 31249),
    ('Нестеров Максим Сергеевич', '24.08.1971', 4, 116417),
    ('Кинжаев Тимофей Наумович', '10.08.1964', 4, 56851),
    ('Ханипов Алексей Климентьевич', '12.05.1973', 10, 124234),
    ('Зырянов Дмитрий Арсеньевич', '20.07.1963', 7, 104310),
    ('Заславский Феликс Трофимович', '02.11.1970', 9, 85647),
    ('Болтунов Петр Ильич', '20.04.1991', 10, 47690),
    ('Ухов Феликс Даниилович', '17.12.1986', 5, 59765),
    ('Бояринов Арсений Семенович', '17.08.1987', 8, 137633),
    ('Николаевский Адам Герасимович', '15.05.1982', 1, 62556),
    ('Тихвинский Иван Прокопьевич', '03.03.1975', 6, 126802),
    ('Чернобровин Филипп Семенович', '28.08.1968', 5, 140606),
    ('Солдатов Трофим Константинович', '27.04.1971', 8, 119369),
    ('Журавлев Валерий Максимович', '27.05.1989', 6, 75677),
    ('Ярема Никита Адамович', '01.07.1995', 10, 34628),
    ('Грибанов Тарас Леонтьевич', '24.10.1992', 4, 61676),
    ('Николаев Максим Юрьевич', '03.01.1983', 1, 99352),
    ('Фомичев Степан Ильич', '14.10.1977', 9, 111606),
    ('Дудко Николай Вениаминович', '12.05.1960', 6, 103039),
    ('Адаксин Лев Никифорович', '08.08.1964', 7, 97082),
    ('Есиков Венедикт Панкратович', '16.07.1981', 2, 136352),
    ('Жиганов Роман Игнатьевич', '16.01.1967', 7, 93227),
    ('Ячиков Иннокентий Валерианович', '20.08.1973', 4, 51391),
    ('Моргунов Даниил Михаилович', '15.11.1985', 9, 135655),
    ('Сенотрусов Григорий Юринович', '09.10.1983', 4, 60321),
    ('Курпатов Захар Георгиевич', '13.03.1977', 7, 101122),
    ('Сонин Георгий Евгеньевич', '17.01.1962', 1, 53691),
    ('Шелепин Филипп Филиппович', '10.06.1982', 10, 101903),
    ('Драгомиров Михаил Романович', '10.06.1988', 2, 131524),
    ('Янкелевич Антон Тимофеевич', '07.12.1990', 3, 35986),
    ('Репин Дмитрий Герасимович', '18.02.1960', 1, 93717),
    ('Слобожанин Кирилл Романович', '07.06.1964', 3, 17438),
    ('Хренов Василий Порфирьевич', '04.07.1974', 1, 117831),
    ('Надервель Павел Николаевич', '18.05.1994', 8, 25668),
    ('Журавлёв Валентин Николаевич', '22.10.1976', 2, 66364),
    ('Ярцов Геннадий Климентович', '25.11.1990', 2, 52500),
    ('Яфаев Ростислав Семенович', '24.08.1967', 1, 19358),
    ('Борцов Севастьян Семенович', '26.12.1974', 4, 96649),
    ('Воронцов Севастьян Трофимович', '14.07.1995', 4, 120687),
    ('Игнатов Никита Маркович', '15.07.1994', 2, 113391),
    ('Немов Федот Макарович', '25.01.1965', 2, 63016),
    ('Квартин Аркадий Антонрвич', '19.05.1977', 7, 125282),
    ('Наполов Феликс Феодосивич', '20.11.1967', 3, 89237),
    ('Ясинов Денис Власович', '19.05.1990', 3, 49223),
    ('Казарезов Ефрем Игнатьевич', '20.12.1977', 6, 28877),
    ('Тихонов Филипп Нифонтович', '06.04.1980', 2, 61020),
    ('Шубин Адам Иннокентиевич', '03.07.1968', 1, 29808),
    ('Грибалев Егор Прохорович', '28.10.1990', 4, 64965),
    ('Теплухин Прохор Степанович', '04.08.1993', 1, 91426),
    ('Житков Максим Алексеевич', '09.07.1980', 1, 53890),
    ('Кулдошин Игнат Витальевич', '10.04.1984', 8, 71217),
    ('Янушевский Семен Саввеевич', '15.01.1990', 4, 68847),
    ('Зуб Ефрем Наумович', '23.02.1976', 2, 81407),
    ('Барсуков Виталий Степанович', '26.06.1968', 2, 53006),
    ('Ширинов Севастьян Петрович', '23.09.1986', 2, 140018),
    ('Кабаидзе Леонид Максимович', '24.05.1984', 5, 65346),
    ('Цой Тарас Ефимович', '17.08.1985', 5, 118075),
    ('Цыгвинцев Никифор Ефимович', '09.03.1990', 6, 89865),
    ('Циолковский Арсений Давидович', '17.09.1975', 8, 64508),
    ('Гнусарев Аркадий Петрович', '09.06.1981', 5, 47472),
    ('Яночкин Яков Иванович', '05.04.1991', 4, 75530),
    ('Грицевец Константин Тимофеевич', '11.11.1961', 4, 109588),
    ('Кондраков Виктор Валерьевич', '13.10.1970', 5, 72392),
    ('Кацен Юрин Ильич', '01.10.1996', 10, 146871),
    ('Анохин Петр Венедиктович', '21.09.1962', 1, 15653),
    ('Корнилов Адам Максимоич', '04.08.1979', 2, 117074),
    ('Голубчиков Константин Васильевич', '18.11.1972', 2, 134939),
    ('Гремпель Севастьян Емельянович', '23.11.1973', 1, 59045),
    ('Тамахин Егор Викторович', '13.08.1961', 3, 43061),
    ('Сязи Ефим Павлович', '01.08.1979', 6, 81048);


INSERT INTO extracted_stats (deposit_id, year, obtained_units)
VALUES
    (1, 2018, 1116.34),
    (1, 2019, 3237.38),
    (1, 2020, 6809.67),
    (2, 2018, 15500.05),
    (2, 2019, 25833.42),
    (2, 2020, 62000.20),
    (3, 2018, 51144.93),
    (3, 2019, 29610.22),
    (3, 2020, 188428.70),
    (4, 2018, 1255.02),
    (4, 2019, 2384.53),
    (4, 2020, 8910.62),
    (5, 2018, 57936.43),
    (5, 2019, 71306.38),
    (5, 2020, 316422.06),
    (6, 2018, 1715.16),
    (6, 2019, 2110.96),
    (6, 2020, 9367.39),
    (7, 2018, 17733.16),
    (7, 2019, 26078.17),
    (7, 2020, 60501.36),
    (8, 2018, 18613.81),
    (8, 2019, 21272.93),
    (8, 2020, 93069.05),
    (9, 2018, 1454.21),
    (9, 2019, 3514.35),
    (9, 2020, 7149.88),
    (10, 2018, 54135.40),
    (10, 2019, 51286.17),
    (10, 2020, 179501.59);
INSERT INTO equipment_models (name, weight, cost, category)
VALUES
    ('Мультифазный перекачивающий  насос двухвинтовый 2ВВ', 8710.72, 11446809.37, 'оборудование для добычи'),
    ('Цементировочный агрегат ЦА-320 (АЦ-32) на шасси УРАЛ 4320', 6449.09, 8758768.67, 'транспорт'),
    ('Агрегат для исследования скважин АИС-1 на Урал 4320', 821.02, 9315463.41, 'транспорт'),
    ('Буровой насос F-1300', 9125.64, 14736026.96, 'оборудование для добычи'),
    ('Устьевые елки Ду 65 мм АФК 2 с двумя дополнительными задвижками на рабочее давление 21,35 Мпа', 391.04, 6120704.76, 'оборудование для добычи'),
    ('Клапан отсекающий КО 302 М Ду-100, 80 Ру-32 МПа (320), 16 МПа (160)', 307.02, 22271213.98, 'оборудование для добычи'),
    ('Агрегат для депарафинизации скважин АДПМ 12/150 на шасси Урал 4320 (6х6)', 3547.96, 37660035.17, 'транспорт'),
    ('Лодка для добычи золота', 4667.91, 26310208.52, 'оборудование для добычи'),
    ('Лодка для добычи алмазов Б-53 11134к', 7410.51, 31428411.50, 'оборудование для добычи'),
    ('Автоцистерна АЦПТ-9,5 на шасси УРАЛ 4320', 5773.60, 11113254.90, 'транспорт'),
    ('Машина для добычи торфа', 4141.60, 150000.00, 'оборудование для добычи'),
    ('Шламы буровые при бурении, связанном с добычей железа', 250.42, 487345.00, 'оборудование для добычи'),
    ('Дробилка большой ёмкости щековая', 5000.00, 4256750.00, 'оборудование для добычи'),
    ('Мини-погрузчик HELFFER MSV-200', 500.00, 1700000.00, 'транспорт'),
    ('Автомобиль "Газель"', 3091.83, 12964251.07, 'транспорт'),
    ('Думпер HELFER MSV-301', 9975.26, 2091461.86, 'транспорт'),
    ('Демонтажные вилы', 436.36, 11272365.23, 'транспорт'),
    ('АДПМ 12/150 на шасси КАМАЗ 43118', 4271.17, 889373.33, 'транспорт'),
    ('Седельный тягач Камаз 43118 с КМУ АНТ-22-2', 2424.47, 2208075.46, 'транспорт');
INSERT INTO equipment_units (equipment_model_id, decommissioning_year)
VALUES
    (7, 2027), -- транспорт
    (1, 2027), -- оборудование для добычи
    (7, 2045), -- транспорт
    (8, 2045), -- оборудование для добычи
    (6, 2045), -- оборудование для добычи
    (4, 2023), -- оборудование для добычи
    (4, 2038), -- оборудование для добычи
    (3, 2022), -- транспорт
    (6, 2039), -- оборудование для добычи
    (10, 2039), -- транспорт
    (7, 2036), -- транспорт
    (5, 2036), -- оборудование для добычи
    (10, 2036), -- транспорт
    (10, 2045), -- транспорт
    (2, 2045), -- транспорт
    (6, 2025), -- оборудование для добычи
    (10, 2022), -- транспорт
    (2, 2023), -- транспорт
    (5, 2031), -- оборудование для добычи
    (6, 2031), -- оборудование для добычи
    (9, 2031), -- оборудование для добычи
    (11, 2024), -- оборудование для добычи
    (12, 2053), -- оборудование для добычи
    (13, 2048), -- оборудование для добычи
    (14, 2041), -- оборудование для добычи
    (16, 2031), -- транспорт
    (18, 2034); -- транспорт

INSERT INTO equipment_availability (deposit_id, equipment_unit_id)
VALUES

    (1, 1), -- transport
    (3, 2),
    (3, 3), -- transport
    (10, 4),
    (2, 5),
    (9, 6),
    (9, 7),
    (4, 8), -- transport
    (4, 9), -- transport
    (5, 10), -- transport
    (6, 11), -- transport
    (6, 26), -- transport
    (8, 12),
    (7, 13), -- transport
    (7, 14), -- transport
    (6, 15), -- transport
    (2, 16),
    (9, 17), -- transport
    (10, 18), -- transport
    (10, 27), -- transport
    (2, 19),
    (8, 20),
    (1, 21),
    (4, 22),
    (5, 23),
    (6, 24),
    (7, 25);

INSERT INTO mining_equipment_stats (model_id, mining_speed)
    VALUES
    (1, 50),
    (4, 88),
    (5, 22),
    (6, 60),
    (8, 53),
    (9, 84),
    (11, 20),
    (12, 48),
    (13, 65);
INSERT INTO transport_stats (model_id, speed, gasoline_consumption)
    VALUES
    (2, 8, 'Normal'),
    (3, 37, 'Normal'),
    (7, 50, 'High'),
    (10, 47, 'Low'),
    (14, 47, 'Low'),
    (15, 84, 'Low'),
    (16, 11, 'Low'),
    (17, 90, 'High'),
    (18, 21, 'Normal'),
    (19, 94, 'Low');

RESET search_path;
